-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 28, 2019 at 05:29 PM
-- Server version: 10.1.30-MariaDB
-- PHP Version: 7.2.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `nah_news`
--

-- --------------------------------------------------------

--
-- Table structure for table `nah_newinfo`
--

CREATE TABLE `nah_newinfo` (
  `nah_newid` int(11) NOT NULL,
  `nah_title` varchar(100) NOT NULL,
  `nah_desc` text NOT NULL,
  `nah_type` varchar(30) NOT NULL,
  `nah_city` varchar(30) NOT NULL,
  `nah_date` date NOT NULL,
  `nah_image` varchar(255) NOT NULL,
  `admin_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `nah_newinfo`
--

INSERT INTO `nah_newinfo` (`nah_newid`, `nah_title`, `nah_desc`, `nah_type`, `nah_city`, `nah_date`, `nah_image`, `admin_id`) VALUES
(1, 'القمة العربية الأوروبية أعادت تقديم مصر للعالم كلاعب رئيسى', '\r\nالشهر القادم، هي خطوات أولى في هذا الاتجاه، ولأن مصر هي المبادر والمضيف لهذه الفاعليات الضخمة التى استطاعت أن تجمع العالم على طاولة واحدة، فإن أهم ما سيعود على مصر منها هو مزيد من الأمن والاستقرار الداخلي، وإعادة تقديم نفسها للعالم كلاعب رئيسي ومحوري في مجال العلاقات قبل اليوم بأربعة سنوات كانت مصر معرضة لحالة تهميش وضغوط اقتصادية وسياسية مهولة من جانب المجتمع الدولي، أما اليوم فالمجتمع الدولي هو من يأتي إلى مصر ليستمع ويتحاور، وهذا هو أكبر مكسب يمكن أن نعتبر أن مصر قد حققته، فضلاً طبعاً عن إعادة موازين الأمور في العالم بين الأقطاب المختلفة، بشكل يخدم مصالح المنطقة ومصالح مصر خصوصاً فيما يتعلق بالأمن والاستقرار السياسي والتنمية الاقتصادية.\r\n\r\n ', 'السياسه', 'القاهره', '2019-02-10', 'upload/19-02-28 04-21-578946708politic-1.jpg', 1),
(12, 'تطور الإقتصاد المصرى بشكل ملحوظ ', 'نلاحظ هذه الفتره تطور كبير فى حالة الإقتصاد المصرى نتيجة المجهودات المبذوله من قبل الوزاره . نلاحظ هذه الفتره تطور كبير فى حالة الإقتصاد المصرى نتيجة المجهودات المبذوله من قبل الوزاره .\r\nنلاحظ هذه الفتره تطور كبير فى حالة الإقتصاد المصرى نتيجة المجهودات المبذوله من قبل الوزاره .نلاحظ هذه الفتره تطور كبير فى حالة الإقتصاد المصرى نتيجة المجهودات المبذوله من قبل الوزاره ', 'الإقتصاد', 'الجيزه', '2019-02-10', 'upload/19-02-28 04-27-512371398econm-2.jpg', 1),
(13, 'حدوث حريق فى أحد المولات الكبرى نتيجة ماس كهربائى ', 'تم الإبلاغ عن وجود حريق فى أحد المولات الكبرى فى صباح اليوم وتم السيطره على هذا الحريق بون أى إصابات. تم الإبلاغ عن وجود حريق فى أحد المولات الكبرى فى صباح اليوم وتم السيطره على هذا الحريق بون أى إصابات.\r\n\r\nتم الإبلاغ عن وجود حريق فى أحد المولات الكبرى فى صباح اليوم وتم السيطره على هذا الحريق بون أى إصابات. تم الإبلاغ عن وجود حريق فى أحد المولات الكبرى فى صباح اليوم وتم السيطره على هذا الحريق بون أى إصابات.', 'الحوادث', 'السويس', '2019-02-11', 'upload/19-02-28 04-35-585268835accid-2.jpg', 1),
(14, 'إستعدادات المنتخب الوطنى لبطولة أمم أفريقيا 2019', 'يعمل إتحاد الكره على تجهيز الملاعب لإستقبال بطولة أمم أفريقيا حيث تم إسناد مهمة التنظيم لمجموعة من الشباب الأكفاء . يعمل إتحاد الكره على تجهيز الملاعب لإستقبال بطولة أمم أفريقيا حيث تم إسناد مهمة التنظيم لمجموعة من الشباب الأكفاء تحت إشراف وزارة الرياضه . \r\nيعمل إتحاد الكره على تجهيز الملاعب لإستقبال بطولة أمم أفريقيا حيث تم إسناد مهمة التنظيم لمجموعة من الشباب الأكفاء . يعمل إتحاد الكره على تجهيز الملاعب لإستقبال بطولة أمم أفريقيا حيث تم إسناد مهمة التنظيم لمجموعة من الشباب الأكفاء .', 'الرياضه', 'الجيزه', '2019-02-11', 'upload/19-02-28 04-41-143015991sport-1.jpg', 1),
(15, 'مهرجان الجونه السينمائى بحضور مجموعه كبيره من الفنانين', 'تم افتتاح مهرجان الجونه السينمائى بحضور كبار الفنانين و المبدعين اليوم حيث يستمر المهرجان لمده أسبوع يتم عرض أحدث الإعمال السينمائيه . تم افتتاح مهرجان الجونه السينمائى بحضور كبار الفنانين و المبدعين اليوم حيث يستمر المهرجان لمده أسبوع يتم عرض أحدث الإعمال السينمائيه .\r\nتم افتتاح مهرجان الجونه السينمائى بحضور كبار الفنانين و المبدعين اليوم حيث يستمر المهرجان لمده أسبوع يتم عرض أحدث الإعمال السينمائيه .تم افتتاح مهرجان الجونه السينمائى بحضور كبار الفنانين و المبدعين اليوم حيث يستمر المهرجان لمده أسبوع يتم عرض أحدث الإعمال السينمائيه . تم افتتاح مهرجان الجونه السينمائى بحضور كبار الفنانين و المبدعين اليوم حيث يستمر المهرجان لمده أسبوع يتم عرض أحدث الإعمال السينمائيه .\r\n', 'الفن', 'الجونه', '2019-02-11', 'upload/19-02-28 04-46-487156618art-2.jpg', 1),
(16, 'اهتمامات كبيره حول تطور التكنولوجيا ', 'وجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها . وجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها .\r\nوجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها .وجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها . وجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها . وجود تطورات سريعه ف الذكاء الإصطناعى وعمل روبوتات مثل الروبوت صوفيا وغيرها .', 'التكنولوجيا', 'القاهره', '2019-02-11', 'upload/19-02-28 04-53-249385319tech-2.jpg', 1),
(17, 'فوز ريال مدريد بكاس السوبر الأسبانى على حساب برشلونه', 'حيث أقيمت أمس مباراة تجمع بين ريال مدريد الأسبانى و برشلونه الأسبانى لتحديد الفائز بكاس السوبر الأسبانى وحقق ريال مدريد الفوز بصعوبه بهدفين مقابل هدف وقد تم إحراز هدف الفوز فى الوقت بدل الضائع. حيث أقيمت أمس مباراة تجمع بين ريال مدريد الأسبانى و برشلونه الأسبانى لتحديد الفائز بكاس السوبر الأسبانى وحقق ريال مدريد الفوز بصعوبه بهدفين مقابل هدف وقد تم إحراز هدف الفوز فى الوقت بدل الضائع. حيث أقيمت أمس مباراة تجمع بين ريال مدريد الأسبانى و برشلونه الأسبانى لتحديد الفائز بكاس السوبر الأسبانى وحقق ريال مدريد الفوز بصعوبه بهدفين مقابل هدف وقد تم إحراز هدف الفوز فى الوقت بدل الضائع.\r\n\r\nحيث أقيمت أمس مباراة تجمع بين ريال مدريد الأسبانى و برشلونه الأسبانى لتحديد الفائز بكاس السوبر الأسبانى وحقق ريال مدريد الفوز بصعوبه بهدفين مقابل هدف وقد تم إحراز هدف الفوز فى الوقت بدل الضائع. حيث أقيمت أمس مباراة تجمع بين ريال مدريد الأسبانى و برشلونه الأسبانى لتحديد الفائز بكاس السوبر الأسبانى وحقق ريال مدريد الفوز بصعوبه بهدفين مقابل هدف وقد تم إحراز هدف الفوز فى الوقت بدل الضائع.', 'الرياضه', 'القاهره', '2019-02-18', 'upload/19-02-28 05-00-156222796sport-2.jpg', 1),
(18, 'التعديلات الوزاريه الجديده', 'تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى .\r\n\r\nتم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى . تم صباح اليوم إصدار قرارات بتعديل الوزاره من قبل الرئيس المصرى عبدالفتاح السيسى .', 'السياسه', 'الجيزه', '2019-02-28', 'upload/19-02-28 05-06-127046168politic-2.jpg', 1),
(19, 'ارتفاع سعر الجنيه المصرى مقابل الدولار الإمريكى', 'هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى .\r\n\r\nهناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى .\r\nهناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى . هناك جهود تبذل من قبل الحكومه لتحسين الوضع الإقتصادى فى مصر وخاصة بعد تعويم الجنيه المصرى .', 'الإقتصاد', 'الجيزه', '2019-02-28', 'upload/19-02-28 05-11-334382104ecom-1.jpg', 2),
(20, 'سقوط جزئى فى أحد الكبارى الموجوده فى محافظة القليوبيه ', 'حدوث سقوط جزئى فى أحد الكبارى الموجوده فى محافظة القليوبيه وتم نقل المصابين للمستشفيات القريبه من الحادث والحالات مستقره ولا يوجد وفيات . حدوث سقوط جزئى فى أحد الكبارى الموجوده فى محافظة القليوبيه وتم نقل المصابين للمستشفيات القريبه من الحادث والحالات مستقره ولا يوجد وفيات . حدوث سقوط جزئى فى أحد الكبارى الموجوده فى محافظة القليوبيه وتم نقل المصابين للمستشفيات القريبه من الحادث والحالات مستقره ولا يوجد وفيات . حدوث سقوط جزئى فى أحد الكبارى الموجوده فى محافظة القليوبيه وتم نقل المصابين للمستشفيات القريبه من الحادث والحالات مستقره ولا يوجد وفيات.', 'الحوادث', 'القليوبيه', '2019-02-28', 'upload/19-02-28 05-16-443541101accid-3.jpg', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `nah_newinfo`
--
ALTER TABLE `nah_newinfo`
  ADD PRIMARY KEY (`nah_newid`),
  ADD KEY `adminID` (`admin_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `nah_newinfo`
--
ALTER TABLE `nah_newinfo`
  MODIFY `nah_newid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `nah_newinfo`
--
ALTER TABLE `nah_newinfo`
  ADD CONSTRAINT `adminID` FOREIGN KEY (`admin_id`) REFERENCES `nah_users` (`nah_userid`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
